OldTests/Linux-Quemu/benchmark_raw_20260414_220122/raw_logs/fio_rand_4k_raw.txt
rand_4k: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.39
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

rand_4k: (groupid=0, jobs=1): err= 0: pid=61317: Tue Apr 14 22:13:57 2026
  read: IOPS=3271, BW=12.8MiB/s (13.4MB/s)(767MiB/60001msec)
    clat (usec): min=65, max=38041, avg=221.42, stdev=243.08
     lat (usec): min=65, max=38041, avg=221.54, stdev=243.12
    clat percentiles (usec):
     |  1.00th=[  106],  5.00th=[  116], 10.00th=[  123], 20.00th=[  137],
     | 30.00th=[  180], 40.00th=[  186], 50.00th=[  192], 60.00th=[  198],
     | 70.00th=[  202], 80.00th=[  210], 90.00th=[  241], 95.00th=[  486],
     | 99.00th=[ 1500], 99.50th=[ 1844], 99.90th=[ 2245], 99.95th=[ 2311],
     | 99.99th=[ 4424]
   bw (  KiB/s): min= 4280, max=15872, per=99.95%, avg=13080.20, stdev=3149.41, samples=119
   iops        : min= 1070, max= 3968, avg=3270.05, stdev=787.35, samples=119
  write: IOPS=3268, BW=12.8MiB/s (13.4MB/s)(766MiB/60001msec); 0 zone resets
    clat (usec): min=49, max=3716, avg=81.54, stdev=73.03
     lat (usec): min=50, max=3717, avg=81.76, stdev=73.20
    clat percentiles (usec):
     |  1.00th=[   53],  5.00th=[   55], 10.00th=[   56], 20.00th=[   57],
     | 30.00th=[   59], 40.00th=[   62], 50.00th=[   65], 60.00th=[   67],
     | 70.00th=[   70], 80.00th=[   74], 90.00th=[   98], 95.00th=[  145],
     | 99.00th=[  478], 99.50th=[  510], 99.90th=[  578], 99.95th=[  611],
     | 99.99th=[  668]
   bw (  KiB/s): min= 4528, max=16288, per=99.93%, avg=13065.75, stdev=3146.18, samples=119
   iops        : min= 1132, max= 4072, avg=3266.44, stdev=786.54, samples=119
  lat (usec)   : 50=0.01%, 100=45.28%, 250=48.40%, 500=3.63%, 750=1.81%
  lat (usec)   : 1000=0.21%
  lat (msec)   : 2=0.50%, 4=0.17%, 10=0.01%, 50=0.01%
  cpu          : usr=2.81%, sys=9.61%, ctx=392417, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=196305,196106,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=12.8MiB/s (13.4MB/s), 12.8MiB/s-12.8MiB/s (13.4MB/s-13.4MB/s), io=767MiB (804MB), run=60001-60001msec
  WRITE: bw=12.8MiB/s (13.4MB/s), 12.8MiB/s-12.8MiB/s (13.4MB/s-13.4MB/s), io=766MiB (803MB), run=60001-60001msec

Disk stats (read/write):
  vda: ios=195923/195749, sectors=1567384/1566184, merge=0/24, ticks=41583/14216, in_queue=55806, util=92.49%